Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/european_education_programmes/comenius.html.txt.tmx
Source language: en
Languages: ga

source: The Comenius programme is part of the Lifelong Learning Programme, an EU-funded education and training programme
ga: Tá an clár Comenius mar chuid den Chlár um Fhoghlaim ar Feadh an tSaoil, clár oideachais agus oiliúna maoinithe ag an AE

source: This programme is closed to new applications and has been replaced by Erasmus+
ga: Tá deireadh leis an gclár d'iarratasóirí nua agus cuireadh Erasmus+ ina áit

source: The Comenius Programme is aimed at:
ga: Tá an Clár Comenius dírithe ar:

source: • Pupils in school to the end of upper secondary education (covering nursery, primary and secondary schooling including technical and vocational education)
ga: • Scoláirí atá ar scoil chomh fada le hoideachas sinsearach iar-bhunscoile (ina n-áirítear naíolann, bunoideachas agus iar-bhunoideachas, gairmoideachas agus oideachas teicniúil san áireamh)

source: • Schools, as specified by member states
ga: • Scoileanna, mar atá sonraithe ag na ballstáit

source: • Teachers and other staff within those schools
ga: • Mhúinteoirí agus ar fhoireann eile na scoileanna sin

source: • Associations, non-profit organisations, NGOs and representatives of those involved in school education
ga: • Chumainn, eagraíochtaí neamhbhrabúis, Eagraíochtaí Neamhrialtais agus ionadaithe dóibh siúd a bhfuil baint acu le hoideachas scoile

source: • People and bodies responsible for the organisation and delivery of education at local, regional and national levels
ga: • Dhaoine agus fhorais a bhfuil dualgas orthu i leith eagrú agus sheachadadh oideachais ag leibhéil áitiúla, réigiúnacha agus náisiúnta

source: • Research centres and bodies concerned with lifelong learning issues
ga: • Ionaid agus fhorais taighde a dhéileálann le cúrsaí um fhoghlaim ar feadh an tsaoil

source: • Bodies providing guidance, counselling and information services relating to any aspect of lifelong learning
ga: • Fhorais a sholáthraíonn treoir, comhairleoireacht agus seirbhísí faisnéise i leith aon ghné den fhoghlaim ar feadh an tsaoil

source: The main specific objectives of the Comenius programme are to:
ga: Is iad seo a leanas príomh-shainchuspóirí Chlár Comenius:

source: • Improve the mobility of pupils and educational staff in the countries involved
ga: • Soghluaiseacht scoláirí agus fhoireann oideachais a fheabhsú sna tíortha lena mbaineann an clár

source: • Encourage the learning of modern foreign languages
ga: • Foghlaim nua-theangacha iasachta a spreagadh

source: • Support the development of innovative ICT-based content, services, teaching methods and practice for lifelong learning
ga: • Tacaíocht a thabhairt d'fhorbairt ábhair, seirbhísí, modhanna agus cleachtais múinte bunaithe ar theicneolaíocht na faisnéise agus nuálaíoch

source: The following actions are supported by the Comenius Programme:
ga: Tacaíonn Clár Comenius leis na bearta seo a leanas:

source: Comenius School Partnership Projects – this promotes transnational cooperation between schools (this replaces the Comenius 1 programme)
ga: Tionscadail Chomhpháirtíocht Scoile Comenius – cothaíonn sé seo comhoibriiú trasnáisiúnta idir scoileanna (tagann sé seo in ionad chlár Comenius 1)

source: Comenius In Service Training for professional development (formerly Comenius 2)
ga: Oiliúint Inseirbhíse Comenius d'fhorbairt ghairmiúil (thugtaí Comenius 2 air)

source: Comenius Multilateral Projects to improve the initial or in-service training of teachers and other people working in the school education sector
ga: Tionscadail Iltaobhacha Comenius a chuirfidh feabhas ar bhun-oiliúint nó ar oiliúint inseirbhíse múinteoirí agus daoine eile atá ag obair san earnáil oideachas scoile

source: Comenius Networks which are designed to create synergies between Comenius school projects and staff training projects (formerly Comenius 3)
ga: Líonraí Comenius atá deartha chun comhoibriú a chothú idir tionscadail scoile agus tionscadail oiliúint foirne Comenius (thugtaí Comenius 3 air)

source: Accompanying Measures (formerly Complementary Measures)
ga: Comhbhearta (thugtaí Bearta Comhlántacha orthu)

source: In Ireland, Comenius is jointly run by the European Commission and Léargas - the Exchange Bureau
ga: In Éirinn, déanann an Coimisiún Eorpach agus Léargas - an Biúró Malartaithe, Comenius a chomhreáchtáil

source: For further information on the application procedures and management of Comenius, you should contact Léargas
ga: Ba chóir duit dul i dteagmháil le Léargas má tá tuilleadh eolais uait maidir le gnáthaimh iarratais agus bainistiú Comenius
